---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotSplitRailingWithExtensions
source: html/132cc53b-8a7d-0285-c2f0-053fefe90670.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotSplitRailingWithExtensions Property

Railings with extensions cannot be split.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotSplitRailingWithExtensions { get; }
```